/*Вариант 2: Реализуйте абстрактную фабрику для создания семейства объектов мебели (например,
             стульев и столов) в различных стилях (например, современный, классический).
TODO: Factory - "мебельный комбинат им.Папы Карло" (абстрактный класс)
        ChairFactory:Factory - цех по производству стульев 
        TableFactory:Factory - цех по производству столов
        WardrobeFactory:Factory - цех по производству шкафов
     Design - дизайн-ателье при комбинате (абстрактный класс)
        Modern:Design - современный 
        Classic:Design - классика
    Furniture - продукция (абстрактный класс)
        Chair:Furniture - стулья
        Table:Furniture - столы
        Wardrobe:Furniture - шкафы 
*/
